#+TITLE: 身體狀況
#+HTML_LINK_UP: ./index.html

* 固定數值

#+NAME: fixed-metrics
| 名稱        |   數值 | 單位  |
|-------------+--------+-------|
| 年齡        |     32 | 年    |
| 身高        |  177.5 | cm    |

* 心肺

#+NAME: heart-reates
| 名稱        |    數值 | 單位  |
|-------------+---------+-------|
| 最大心率    |  185.46 | 跳/分 |
| 安靜心律    |         | 跳/分 |
| 低強度(60%) | 111.276 | 跳/分 |
| 中強度(80%) | 148.368 | 跳/分 |
| 高強度(90%) | 166.914 | 跳/分 |
#+TBLFM: @2$2=206.9-(0.67*remote(fixed-metrics, @2$2))::@3$2=@2$2*0.6::@4$2=@2$2*0.8::@5$2=@2$2*0.9

** 如何量心率
*** 最大心率
*** 安靜心律 
0. 早上起來3-5分後進行。
1.食指及中指併攏輕觸橈腕動脈或頸動脈。 
2.測量10秒或15秒，再乘以6或4即為每分鐘的心跳數。

* 體態構成

** 目前
#+NAME: current-weight
| 名稱             |  數值 | 單位  |
|------------------+-------+-------|
| 當前基礎代謝     |  1944 | 卡    |
| 建議每日攝取熱量 |  2340 | 卡    |
| 當前體重         |  93.6 | kg    |
| 當前體脂率       |    30 | %     |
| 內臟脂肪         |    15 | kg    |
| BMI              |  29.7 | kg/m2 |
| 當前脂肪重       | 26.97 | kg    |
#+TBLFM: @3$2=@2$2*@3$2*0.01

** 目標 
#+NAME: target-weight
| 名稱       |   數值 | 單位 |
|------------+--------+------|
| 目標體脂率 |     22 | %    |
| 目標脂肪重 | 20.592 | kg   |
| 消去脂肪重 |  6.378 | kg   |
#+TBLFM: @3$2=remote(current-weight, @4$2) * @2$2 * 0.01::@4$2=remote(current-weight, @8$2) - @3$2

* 減脂
** 運動計畫 

| 名稱           |    數值 | 單位 |
|----------------+---------+------|
| 減脂需要卡路里 | 49110.6 | 卡   |
| 每日減少卡路里 |     500 | 卡   |
| 需要天數       | 98.2212 | 天   |
| 需要月數       | 3.27404 | 月   |
#+TBLFM: @2$2=remote(target-weight, @4$2) * 7700::@4$2=@2$2/@3$2::@5$2=@4$2/30::@6$2=remote(current-weight, @3$2) - @3$2

** 飲食控制
- 晚餐 6:00 前吃完。
- 太餓的話上午10:00, 下午三點左右吃一根香蕉。

*** 熱量表
- 嫩切雞肉 300卡
- 香蕉一根 120卡
- 高纖無糖豆漿 147卡
- 鮮奶茶 350卡
- 無糖拿鐵 166卡
*** Week 1

* 參考資料
** 90 天減脂計畫 
- http://shareonion.com/articles/1489
** 紀錄片 [[ahttp://topdocumentaryfilms.com/10-things-you-need-to-know-about-losing-weight/][減肥十律]]
- 三餐要保持，否則大腦會只是我們找高卡路里的食物
- 大盤換小盤，可以減少20%進食量.
- 計算卡路里。
- 別責怪你的新陳代謝，每個人的速度其實差不多。
- 蛋白質高的食物，如雞蛋，豆子，瘦肉可以維持更長時間的飽脹感。
- 濃稠的糖可讓人飽脹時間更長
- 選擇多，吃也多
- 低脂奶製品可幫至我們排泄更多脂肪
- 多做運動，能保持身體代謝脂肪率很長一段時間
- 多做小運動，如走路上班，爬樓梯。
